<?php
///////////////////////////////////////////////////////////
// Входные данные:                                       //
// Нужно ввести два числа.                               //
///////////////////////////////////////////////////////////
// Выходные данные:                                      //
// Нужно вывести разность первого и второго числа        //
// как прибыль, если второе число больше первого,        //
// или как убыток, если второе число меньше первого,     //
// иначе, если числа равны, вывести сообщение            //
// об отсутствии прибыли и убытка.                       //
///////////////////////////////////////////////////////////
?>