<?php
///////////////////////////////////////////////////////////
// Входные данные:                                       //
// Нужно ввести 0.                                       //
///////////////////////////////////////////////////////////
// Выходные данные:                                      //
// Нужно вывести сообщение об ошибке.                    //
///////////////////////////////////////////////////////////

// Входные данные
$number = readline("Введите число 0: ");

try {
	echo 10 / $number;
} catch (DivisionByZeroError $e) {
	echo "No way!";
}
?>