<?php
///////////////////////////////////////////////////////////
// Входные данные:                                       //
// Нужно ввести число больше 1.                          //
///////////////////////////////////////////////////////////
// Выходные данные:                                      //
// Нужно вывести все числа от 1 до введенного числа.     //
///////////////////////////////////////////////////////////

// Входные данные
$number = readline("Введите число больше 1: ");

// Выходные данные
if ($number < 1) {
	echo "Неверный ввод";
	exit(2);
}

$output = "";

for ($i = 1; $i <= $number; $i++) {
	$output .= $i . ", ";
}

$output = substr($output, 0, -2);
echo $output;
?>