<?php
///////////////////////////////////////////////////////////
// Входные данные:                                       //
// Нужно ввести число от 1.                              //
///////////////////////////////////////////////////////////
// Выходные данные:                                      //
// Нужно вывести сумму чисел от 1 до введенного числа.   //
///////////////////////////////////////////////////////////
// Задачу необходимо решить с помощью рекурсии.          //
///////////////////////////////////////////////////////////

// Входные данные
$number = readline("Введите число от 1: ");

if ($number < 1) {
	echo "Неверный ввод";
	exit(2);
}

// Выходные данные
$number = (int)$number;

function sum_recursion($number) {
	function inner($number) {
		$result = 0;

		if ($number < 1) {
			return 1;
		}
		
		$result += inner($number - 1);

		return $result;
	}

	return inner($number);
}

echo sum_recursion($number);
?>