<?php
///////////////////////////////////////////////////////////
// Входные данные:                                       //
// Нужно ввести два числа.                               //
///////////////////////////////////////////////////////////
// Выходные данные:                                      //
// Нужно вывести первое число, если оно больше второго,  //
// или второе число, если оно больше первого,            //
// иначе вывести любое из чисел, так как они равны.      //
///////////////////////////////////////////////////////////
// Необходимо решить задачу с использованием switch.     //
///////////////////////////////////////////////////////////

// Входные данные
$firstNumber = readline("Введите первое число: ");
$secondNumber = readline("Введите второе число: ");

switch (true) {
	case $firstNumber > $secondNumber:
		echo $firstNumber;
		break;
	case $firstNumber < $secondNumber:
		echo $secondNumber;
		break;
	case $firstNumber === $secondNumber:
		// Выводим любое из чисел, так как они равны
		echo $firstNumber;
}
?>