<?php
///////////////////////////////////////////////////////////
// Входные данные:                                       //
// Нужно ввести число от 0 и до 100.                     //
///////////////////////////////////////////////////////////
// Выходные данные:                                      //
// Нужно вывести, является ли введенное число            //
// возрастом совершеннолетия.                            //
///////////////////////////////////////////////////////////

// Входные данные
$number = readline("Ваш возраст: ");

// Выходные данные
if (($number < 0) || ($number > 100)) {
	echo "Неверный ввод";
	exit(2);
}

$output = $number >= 18 ? "Совершеннолетний" : "Несовершеннолетний";
echo $output;
?>